app/Controllers/Estudiantes.php

SELECT *
FROM `estudiantes`
 LIMIT 1, 1
SELECT COUNT(*) AS `numrows`
FROM `estudiantes`
---
    public function index()
    {

        $estudiantesModel = model(EstudiantesModel::class);
        $data = [
            "estudiantes" => $estudiantesModel->paginate(1),
            'pager' => $estudiantesModel->pager
        ];

SELECT *
FROM `estudiantes`
WHERE `estudiantes`.`id` = 3
---
    public function update($id = null){
        $estudiantesModel = model(EstudiantesModel::class);
        $data['currentStudent'] = $estudiantesModel->find($id+0);

SELECT *
FROM `estudiantes`
WHERE `estudiantes`.`id` = 3
---
    public function actionUpdate(){
        $estudiantesModel = model(EstudiantesModel::class);
        $id = $this->request->getVar('id');

        $currentStudent = $estudiantesModel->find($id+0);